app/controllers/friends_controller.rb

SELECT "friends".* FROM "friends"
---
  def index
    @friends = Friend.all

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "created_at", "updated_at", "user_id") VALUES ('sheik', 'dawood', 's@gmail.com', '1234567890', '2025-02-19 17:29:39.851754', '2025-02-19 17:29:39.851754', 2) RETURNING "id"
---
  def create
    @friend = current_user.friends.build(friend_params)
    respond_to do |format|
      if @friend.save

SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = 1 AND "friends"."id" = 1 LIMIT 1
---
  def correct_user
    @friend = current_user.friends.find_by(id: params[:id])

SELECT "friends".* FROM "friends" WHERE "friends"."id" = 1 LIMIT 1
---
    def set_friend
      @friend = Friend.find(params[:id])